NOAA-PMEL/EDD-LCP_PistonDriver/Firmware/LCP_PistonDriver/test/msp430fr5898.h
/* TB0CCTL Control Bits */
#define CLLD                             (0x0600)        /* Compare latch load */
#define CLLD_H                           (0x0006)
#define CLLD0                            (0x0200)        /* Compare latch load */
#define CLLD0_H                          (0x0002)
#define CLLD1                            (0x0400)        /* Compare latch load */
#define CLLD1_H                          (0x0004)
#define CLLD_0                           (0x0000)        /* TBxCLn loads on write to TBxCCRn */
#define CLLD_1                           (0x0200)        /* TBxCLn loads when TBxR counts to 0 */
#define CLLD_1_H                         (0x0002)
#define CLLD_2                           (0x0400)        /* TBxCLn loads when TBxR counts to 0 (up or continuous mode). 
                                                            TBxCLn loads when TBxR counts to TBxCL0 or to 0 (up/down mode).
 */
#define CLLD_2_H                         (0x0004)
#define CLLD_3                           (0x0600)        /* TBxCLn loads when TBxR counts to TBxCLn */
#define CLLD_3_H                         (0x0006)

/* TB0R Control Bits */
#define TBXR                             (0xffff)        /* Timer_B count register */
#define TBXR_L                           (0x00ff)
#define TBXR_H                           (0x00ff)
#define TBXR0                            (0x0001)        /* Timer_B count register */
#define TBXR0_L                          (0x0001)
#define TBXR1                            (0x0002)        /* Timer_B count register */
#define TBXR1_L                          (0x0002)
#define TBXR2                            (0x0004)        /* Timer_B count register */
#define TBXR2_L                          (0x0004)
#define TBXR3                            (0x0008)        /* Timer_B count register */
#define TBXR3_L                          (0x0008)
#define TBXR4                            (0x0010)        /* Timer_B count register */
#define TBXR4_L                          (0x0010)
#define TBXR5                            (0x0020)        /* Timer_B count register */
#define TBXR5_L                          (0x0020)
#define TBXR6                            (0x0040)        /* Timer_B count register */
#define TBXR6_L                          (0x0040)
#define TBXR7                            (0x0080)        /* Timer_B count register */
#define TBXR7_L                          (0x0080)
#define TBXR8                            (0x0100)        /* Timer_B count register */
#define TBXR8_H                          (0x0001)
#define TBXR9                            (0x0200)        /* Timer_B count register */
#define TBXR9_H                          (0x0002)
#define TBXR10                           (0x0400)        /* Timer_B count register */
#define TBXR10_H                         (0x0004)
#define TBXR11                           (0x0800)        /* Timer_B count register */
#define TBXR11_H                         (0x0008)
#define TBXR12                           (0x1000)        /* Timer_B count register */
#define TBXR12_H                         (0x0010)
#define TBXR13                           (0x2000)        /* Timer_B count register */
#define TBXR13_H                         (0x0020)
#define TBXR14                           (0x4000)        /* Timer_B count register */
#define TBXR14_H                         (0x0040)
#define TBXR15                           (0x8000)        /* Timer_B count register */
#define TBXR15_H                         (0x0080)

/* TB0CCR Control Bits */
#define TBXCCRN                          (0xffff)        /* Timer_B capture/compare register. */
#define TBXCCRN_L                        (0x00ff)
#define TBXCCRN_H                        (0x00ff)
#define TBXCCRN0                         (0x0001)        /* Timer_B capture/compare register. */
#define TBXCCRN0_L                       (0x0001)
#define TBXCCRN1                         (0x0002)        /* Timer_B capture/compare register. */
#define TBXCCRN1_L                       (0x0002)
#define TBXCCRN2                         (0x0004)        /* Timer_B capture/compare register. */
#define TBXCCRN2_L                       (0x0004)
#define TBXCCRN3                         (0x0008)        /* Timer_B capture/compare register. */
#define TBXCCRN3_L                       (0x0008)
#define TBXCCRN4                         (0x0010)        /* Timer_B capture/compare register. */
#define TBXCCRN4_L                       (0x0010)
#define TBXCCRN5                         (0x0020)        /* Timer_B capture/compare register. */
#define TBXCCRN5_L                       (0x0020)
#define TBXCCRN6                         (0x0040)        /* Timer_B capture/compare register. */
#define TBXCCRN6_L                       (0x0040)
#define TBXCCRN7                         (0x0080)        /* Timer_B capture/compare register. */
#define TBXCCRN7_L                       (0x0080)
#define TBXCCRN8                         (0x0100)        /* Timer_B capture/compare register. */
#define TBXCCRN8_H                       (0x0001)
#define TBXCCRN9                         (0x0200)        /* Timer_B capture/compare register. */
#define TBXCCRN9_H                       (0x0002)
#define TBXCCRN10                        (0x0400)        /* Timer_B capture/compare register. */
#define TBXCCRN10_H                      (0x0004)
#define TBXCCRN11                        (0x0800)        /* Timer_B capture/compare register. */
#define TBXCCRN11_H                      (0x0008)
#define TBXCCRN12                        (0x1000)        /* Timer_B capture/compare register. */
#define TBXCCRN12_H                      (0x0010)
#define TBXCCRN13                        (0x2000)        /* Timer_B capture/compare register. */
#define TBXCCRN13_H                      (0x0020)
#define TBXCCRN14                        (0x4000)        /* Timer_B capture/compare register. */
#define TBXCCRN14_H                      (0x0040)
#define TBXCCRN15                        (0x8000)        /* Timer_B capture/compare register. */
#define TBXCCRN15_H                      (0x0080)

/* TB0EX0 Control Bits */
#define TBIDEX                           (0x0007)        /* Input divider expansion */
#define TBIDEX_L                         (0x0007)
#define TBIDEX0                          (0x0001)        /* Input divider expansion */
#define TBIDEX0_L                        (0x0001)
#define TBIDEX1                          (0x0002)        /* Input divider expansion */
#define TBIDEX1_L                        (0x0002)
#define TBIDEX2                          (0x0004)        /* Input divider expansion */
#define TBIDEX2_L                        (0x0004)
#define TBIDEX_0                         (0x0000)        /* Divide by 1 */
#define TBIDEX_1                         (0x0001)        /* Divide by 2 */
#define TBIDEX_1_L                       (0x0001)
#define TBIDEX_2                         (0x0002)        /* Divide by 3 */
#define TBIDEX_2_L                       (0x0002)
#define TBIDEX_3                         (0x0003)        /* Divide by 4 */
#define TBIDEX_3_L                       (0x0003)
#define TBIDEX_4                         (0x0004)        /* Divide by 5 */
#define TBIDEX_4_L                       (0x0004)
#define TBIDEX_5                         (0x0005)        /* Divide by 6 */
#define TBIDEX_5_L                       (0x0005)
#define TBIDEX_6                         (0x0006)        /* Divide by 7 */
#define TBIDEX_6_L                       (0x0006)
#define TBIDEX_7                         (0x0007)        /* Divide by 8 */
#define TBIDEX_7_L                       (0x0007)
#define TBIDEX__1                        (0x0000)        /* Divide by 1 */
#define TBIDEX__2                        (0x0001)        /* Divide by 2 */
#define TBIDEX__2_L                      (0x0001)
#define TBIDEX__3                        (0x0002)        /* Divide by 3 */
#define TBIDEX__3_L                      (0x0002)
#define TBIDEX__4                        (0x0003)        /* Divide by 4 */
#define TBIDEX__4_L                      (0x0003)
#define TBIDEX__5                        (0x0004)        /* Divide by 5 */
#define TBIDEX__5_L                      (0x0004)
#define TBIDEX__6                        (0x0005)        /* Divide by 6 */
#define TBIDEX__6_L                      (0x0005)
#define TBIDEX__7                        (0x0006)        /* Divide by 7 */
#define TBIDEX__7_L                      (0x0006)
#define TBIDEX__8                        (0x0007)        /* Divide by 8 */
#define TBIDEX__8_L                      (0x0007)

/* TB0IV Control Bits */
#define TBIV                             (0xffff)        /* Timer_B interrupt vector value */
#define TBIV_L                           (0x00ff)
#define TBIV_H                           (0x00ff)
#define TBIV0                            (0x0001)        /* Timer_B interrupt vector value */
#define TBIV0_L                          (0x0001)
#define TBIV1                            (0x0002)        /* Timer_B interrupt vector value */
#define TBIV1_L                          (0x0002)
#define TBIV2                            (0x0004)        /* Timer_B interrupt vector value */
#define TBIV2_L                          (0x0004)
#define TBIV3                            (0x0008)        /* Timer_B interrupt vector value */
#define TBIV3_L                          (0x0008)
#define TBIV4                            (0x0010)        /* Timer_B interrupt vector value */
#define TBIV4_L                          (0x0010)
#define TBIV5                            (0x0020)        /* Timer_B interrupt vector value */
#define TBIV5_L                          (0x0020)
#define TBIV6                            (0x0040)        /* Timer_B interrupt vector value */
#define TBIV6_L                          (0x0040)
#define TBIV7                            (0x0080)        /* Timer_B interrupt vector value */
#define TBIV7_L                          (0x0080)
#define TBIV8                            (0x0100)        /* Timer_B interrupt vector value */
#define TBIV8_H                          (0x0001)
#define TBIV9                            (0x0200)        /* Timer_B interrupt vector value */
#define TBIV9_H                          (0x0002)
#define TBIV10                           (0x0400)        /* Timer_B interrupt vector value */
#define TBIV10_H                         (0x0004)
#define TBIV11                           (0x0800)        /* Timer_B interrupt vector value */
#define TBIV11_H                         (0x0008)
#define TBIV12                           (0x1000)        /* Timer_B interrupt vector value */
#define TBIV12_H                         (0x0010)
#define TBIV13                           (0x2000)        /* Timer_B interrupt vector value */
#define TBIV13_H                         (0x0020)
#define TBIV14                           (0x4000)        /* Timer_B interrupt vector value */
#define TBIV14_H                         (0x0040)
#define TBIV15                           (0x8000)        /* Timer_B interrupt vector value */
#define TBIV15_H                         (0x0080)
#define TBIV_0                           (0x0000)        /* No interrupt pending */
#define TBIV_2                           (0x0002)        /* Interrupt Source: Capture/compare 1; Interrupt Flag: TBxCCR1 
                                                            CCIFG; Interrupt Priority: Highest */
#define TBIV_2_L                         (0x0002)
#define TBIV_4                           (0x0004)        /* Interrupt Source: Capture/compare 2; Interrupt Flag: TBxCCR2 
                                                            CCIFG */
#define TBIV_4_L                         (0x0004)
#define TBIV_6                           (0x0006)        /* Interrupt Source: Capture/compare 3; Interrupt Flag: TBxCCR3 
                                                            CCIFG */
#define TBIV_6_L                         (0x0006)
#define TBIV_8                           (0x0008)        /* Interrupt Source: Capture/compare 4; Interrupt Flag: TBxCCR4 
                                                            CCIFG */
#define TBIV_8_L                         (0x0008)
#define TBIV_10                          (0x000a)        /* Interrupt Source: Capture/compare 5; Interrupt Flag: TBxCCR5 
                                                            CCIFG */
#define TBIV_10_L                        (0x000a)
#define TBIV_12                          (0x000c)        /* Interrupt Source: Capture/compare 6; Interrupt Flag: TBxCCR6 
                                                            CCIFG */
#define TBIV_12_L                        (0x000c)
#define TBIV_14                          (0x000e)        /* Interrupt Source: Timer overflow; Interrupt Flag: TBxCTL TBIFG;
                                                            Interrupt Priority: Lowest */
#define TBIV_14_L                        (0x000e)
#define TBIV__NONE                       (0x0000)        /* No interrupt pending */
#define TBIV__TBCCR1                     (0x0002)        /* Interrupt Source: Capture/compare 1; Interrupt Flag: TBxCCR1 
                                                            CCIFG; Interrupt Priority: Highest */
#define TBIV__TBCCR1_L                   (0x0002)
#define TBIV__TBCCR2                     (0x0004)        /* Interrupt Source: Capture/compare 2; Interrupt Flag: TBxCCR2 
                                                            CCIFG */
#define TBIV__TBCCR2_L                   (0x0004)
#define TBIV__TBCCR3                     (0x0006)        /* Interrupt Source: Capture/compare 3; Interrupt Flag: TBxCCR3 
                                                            CCIFG */
#define TBIV__TBCCR3_L                   (0x0006)
#define TBIV__TBCCR4                     (0x0008)        /* Interrupt Source: Capture/compare 4; Interrupt Flag: TBxCCR4 
                                                            CCIFG */
#define TBIV__TBCCR4_L                   (0x0008)
#define TBIV__TBCCR5                     (0x000a)        /* Interrupt Source: Capture/compare 5; Interrupt Flag: TBxCCR5 
                                                            CCIFG */
#define TBIV__TBCCR5_L                   (0x000a)
#define TBIV__TBCCR6                     (0x000c)        /* Interrupt Source: Capture/compare 6; Interrupt Flag: TBxCCR6 
                                                            CCIFG */
#define TBIV__TBCCR6_L                   (0x000c)
#define TBIV__TBIFG                      (0x000e)        /* Interrupt Source: Timer overflow; Interrupt Flag: TBxCTL TBIFG;
                                                            Interrupt Priority: Lowest */
#define TBIV__TBIFG_L                    (0x000e)


