NOAA-PMEL/EDD-LCP_PistonDriver/Firmware/LCP_PistonDriver/test/msp430fr5898.h
#define __MSP430_BASEADDRESS_ADC12_B__ 0x0800
#define ADC12_B_BASE           __MSP430_BASEADDRESS_ADC12_B__

/** UC Ports */
extern uint16_t UCA0BRW;
extern uint16_t UCA0CTLW0;
extern uint16_t UCA0CTLW1;
extern uint16_t UCA0MCTLW;
extern uint16_t UCA0IE;
extern uint16_t UCA0STATW;
extern uint16_t UCA0TXBUF;
extern uint16_t UCA0RXBUF;

extern uint16_t UCA1BRW;
extern uint16_t UCA1CTLW0;
extern uint16_t UCA1CTLW1;
extern uint16_t UCA1MCTLW;
extern uint16_t UCA1IE;
extern uint16_t UCA1STATW;
extern uint16_t UCA1TXBUF;
extern uint16_t UCA1RXBUF;

extern uint16_t UCA2BRW;
extern uint16_t UCA2CTLW0;
extern uint16_t UCA2CTLW1;
extern uint16_t UCA2MCTLW;
extern uint16_t UCA2IE;
extern uint16_t UCA2STATW;
extern uint16_t UCA2TXBUF;
extern uint16_t UCA2RXBUF;

extern uint16_t UCA3BRW;
extern uint16_t UCA3CTLW0;
extern uint16_t UCA3CTLW1;
extern uint16_t UCA3MCTLW;
extern uint16_t UCA3IE;
extern uint16_t UCA3STATW;
extern uint16_t UCA3TXBUF;
extern uint16_t UCA3RXBUF;



/** GPIO Ports and Settings */
extern uint16_t P1OUT;
extern uint16_t P2OUT;
extern uint16_t P3OUT;
extern uint16_t P4OUT;
extern uint16_t P5OUT;
extern uint16_t P6OUT;
extern uint16_t P7OUT;
extern uint16_t P8OUT;

extern uint16_t P1IN;
extern uint16_t P2IN;
extern uint16_t P3IN;
extern uint16_t P4IN;
extern uint16_t P5IN;
extern uint16_t P6IN;
extern uint16_t P7IN;
extern uint16_t P8IN;

extern uint16_t P1DIR;
extern uint16_t P2DIR;
extern uint16_t P3DIR;
extern uint16_t P4DIR;
extern uint16_t P5DIR;
extern uint16_t P6DIR;
extern uint16_t P7DIR;
extern uint16_t P8DIR;

extern uint16_t P1SEL0;
extern uint16_t P2SEL0;
extern uint16_t P3SEL0;
extern uint16_t P4SEL0;
extern uint16_t P5SEL0;
extern uint16_t P6SEL0;
extern uint16_t P7SEL0;
extern uint16_t P8SEL0;

extern uint16_t P1SEL1;
extern uint16_t P2SEL1;
extern uint16_t P3SEL1;
extern uint16_t P4SEL1;
extern uint16_t P5SEL1;
extern uint16_t P6SEL1;
extern uint16_t P7SEL1;
extern uint16_t P8SEL1;

extern uint16_t P1REN;
extern uint16_t P2REN;
extern uint16_t P3REN;
extern uint16_t P4REN;
extern uint16_t P5REN;
extern uint16_t P6REN;
extern uint16_t P7REN;
extern uint16_t P8REN;

extern uint16_t P1IFG;
extern uint16_t P2IFG;
extern uint16_t P3IFG;
extern uint16_t P4IFG;
extern uint16_t P5IFG;
extern uint16_t P6IFG;
extern uint16_t P7IFG;
extern uint16_t P8IFG;

extern uint16_t P1IES;
extern uint16_t P2IES;
extern uint16_t P3IES;
extern uint16_t P4IES;
extern uint16_t P5IES;
extern uint16_t P6IES;
extern uint16_t P7IES;
extern uint16_t P8IES;

extern uint16_t P1IE;
extern uint16_t P2IE;
extern uint16_t P3IE;
extern uint16_t P4IE;
extern uint16_t P5IE;
extern uint16_t P6IE;
extern uint16_t P7IE;
extern uint16_t P8IE;



#define UCASTP_0     0x00
#define UCASTP_1    0x01
#define UCASTP_2    0x02

#endif